Autodesk.Revit.DB.RoutingPreferenceRule.AddCriterion(Autodesk.Revit.DB.RoutingCriterionBase)
Adds a new routing criterion.
myCriterion:
The criterion to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.#ctor(Autodesk.Revit.DB.ElementId,System.String)
Constructs a RoutingPreferenceRule containing a segment or fitting Id (MEPPartId) and description.
MEPPartId:
The Id of the segment or fitting.  InvalidElementId may be specified if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
description:
The description of the rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013